Repository: alarionov123/show_empty_categories
Catalog: var/langs/*/addons/show_empty_categories.po
Languages: ru_ru

# Addons::name::show_empty_categories
source: Categories without products
ru_ru: Категории без товаров

# Addons::description::show_empty_categories
source: Allows you to update categories' statuses depending on the products count per each category
ru_ru: Модуль позволяет управлять отображением категорий магазина на витрине в зависимости от наличия в ней товаров.

# Languages::categories.show_empty_categories
source: Hide empty categories
ru_ru: Категории без товаров

# Languages::show_when_empty
source: Show the category on the storefront
ru_ru: Показывать категорию на витрине

# Languages::show_empty_categories.tt_views_categories_update_empty
source: Show the category on the storefront even if it is empty
ru_ru: Показывать категорию на витрине даже если в ней нет товаров

# SettingsOptions::show_empty_categories::default_value_for_cat
source: Default value for all categories
ru_ru: Значение для категорий по умолчанию

# SettingsVariants::show_empty_categories::default_value_for_cat::N
source: Hide all empty categories in the store
ru_ru: Скрыть все пустые категории в магазине

# SettingsVariants::show_empty_categories::default_value_for_cat::Y
source: Show all the categories on the storefront even if it is empty
ru_ru: Показывать все категории на витрине даже если в них нет товаров

# Languages::text_categories_updated
source: Categories have been synchronized succesfully
ru_ru: Категории успешно синхронизированы

# Languages::show_empty_categories_info.text_sync
source: To synchronize products' count in your categories, please <a class="cm-ajax cm-comet btn btn-primary" href="[sync_url]">Synchronize categories</a>
ru_ru: Для того чтобы обновить статусы категорий в зависимости от наличия в них товаров, пожалуйста нажмите <a class="cm-ajax cm-comet btn btn-primary" href="[sync_url]">Синхронизировать категории</a>

# Languages::show_empty_categories.text_sync_cron
source: You can run the synchronization of the categories automatically at certain time intervals. To do it, add the following command to CRON:
ru_ru: Вы можете запускать обновление категорий без товаров автоматически через определённые промежутки времени. Для этого добавьте в CRON следующую команду:

# SettingsOptions::show_empty_categories::information
source: Information
ru_ru: Информация

# SettingsOptions::show_empty_categories::site_setting
source: Category settings
ru_ru: Настройки категорий

# Languages::empty_categories.return_to_default
source: The categories and menu item statuses have been returned to default. After next add-on installation/activation you'd need to sync the categories again.
ru_ru: Статусы категорий и элементов меню были возвращенны к значению по умолчанию. После следующей установки/активации модуля вам будет необходимо синхронизировать категории еще раз.

# Languages::instructions_to_sync
source: To hide empty categories, please synchronize them in the add-on's settings.
ru_ru: Для того чтобы скрыть категории без товаров, пожалуйста синхронизируйте их в настройках модуля.

# SettingsVariants::show_empty_categories::hide_menu_items::N
source: Do not hide category-assigned menu items
ru_ru: Не скрывать элементы меню используемые для категорий

# SettingsVariants::show_empty_categories::hide_menu_items::Y
source: Hide category-assigned menu item if the category gets hidden
ru_ru: Скрывать элементы меню используемые для категорий если категория была скрыта

# SettingsOptions::show_empty_categories::hide_menu_items
source: Menu items
ru_ru: Элементы меню

# SettingsVariants::show_empty_categories::hide_parent_categories::Y
source: Hide empty parent categories
ru_ru: Скрывать пустые родительские категории

# SettingsVariants::show_empty_categories::hide_parent_categories::N
source: Do not hide parent categories
ru_ru: Не скрывать родительские категории

# SettingsOptions::show_empty_categories::hide_parent_categories
source: Parent categories
ru_ru: Родительские категории
